fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПланированиеОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПроверитьИПодсветитьНаСервере();   
	
	Если ТекущийОбъект.Проведен Тогда   
		Элементы.ОтпускаСотрудниковКоманднаяПанель.ПодчиненныеЭлементы.ОтпускаСотрудниковЗаполнить.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДатаОкончания) Тогда
		Возврат;
	КонецЕСли;	
	
	
	Если ТекущаяСтрока.ДатаНачала > ТекущаяСтрока.ДатаОкончания Тогда
		 ТекущаяСтрока.ДатаНачала = "";
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Дата начала отпуска не может быть позже даты окончания";
		 Сообщение.Сообщить(); 
		 Возврат;
	КонецЕсли;	
	
	ПроверитьИПодсветить();

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДатаНачала) Тогда
		Возврат;
	КонецЕСли;	  
	
	Если ТекущаяСтрока.ДатаНачала > ТекущаяСтрока.ДатаОкончания Тогда
		 ТекущаяСтрока.ДатаОкончания = "";
		 Сообщение = Новый СообщениеПользователю;
		 Сообщение.Текст = "Дата окончания отпуска не может быть раньше даты начала";
		 Сообщение.Сообщить(); 
		 Возврат;
	КонецЕсли;	

	
	ПроверитьИПодсветить();
КонецПроцедуры   


&НаКлиенте
Процедура ОтпускаСотрудниковПослеУдаления(Элемент)
	ПроверитьИПодсветить();
КонецПроцедуры
#КонецОбласти 


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура АнализГрафика(Команда)   
	
	АдресДанныхВХранилище = ПоместитьДанныеВХранилище();   
		
	ПараметрыФормыАнализа = Новый Структура;
	ПараметрыФормыАнализа.Вставить("АдресДанныхВХранилище", АдресДанныхВХранилище);   
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормыАнализа, ЭтотОбъект);  
	
КонецПроцедуры


&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(Объект.Год);
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте 
Процедура ПроверитьИПодсветить()
	ПроверитьИПодсветитьНаСервере();
КонецПроцедуры	


&НаСервере
Процедура ОформитьСтрокиНаСервере(СписокСотрудников)  
	
	УсловноеОформление.Элементы.Очистить();
	
	Если СписокСотрудников.Количество() > 0 Тогда

		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветМеткиРозовый);
		ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		                                                        
		ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
		ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементУсловия.ПравоеЗначение = СписокСотрудников;
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковНомерСтроки");
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");  
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");   
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");   
	КонецЕсли;	


КонецПроцедуры	

&НаСервере
Функция НайтиСотрудниковОтпускБольше28Дней()
	
	СекундВДне = 24*60*60;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ОтпускаТЧ = ДокументОбъект.ОтпускаСотрудников.Выгрузить();
	ОтпускаТЧ.Колонки.Добавить("КоличествоДней");
	
	СписокСотрудников = Новый СписокЗначений;
	
	Для Каждого СтрокаТЧ Из ОтпускаТЧ Цикл
		КоличествоДней = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала)/СекундВДне; 
		СтрокаТЧ.КоличествоДней = КоличествоДней;
	КонецЦикла;
	
	ОтпускаТЧ.Свернуть("Сотрудник", "КоличествоДней");
	Для Каждого СтрокаТЧ Из ОтпускаТЧ Цикл
		Если СтрокаТЧ.КоличествоДней > 28 Тогда
			СписокСотрудников.Добавить(СтрокаТЧ.Сотрудник);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СписокСотрудников;
	
КонецФункции	

&НаСервере
Процедура ПроверитьИПодсветитьНаСервере()

	СписокСотрудников = НайтиСотрудниковОтпускБольше28Дней();
	ОформитьСтрокиНаСервере(СписокСотрудников);
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВХранилище() 
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Год", Объект.Год);
	ДанныеДокумента.Вставить("ОтпускаСотрудников", Объект.ОтпускаСотрудников.Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеДокумента, УникальныйИдентификатор);  
КонецФункции	

  &НаСервере
Процедура ЗаполнитьНаСервере(Год)    
	  
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ВыполнитьАвтозаполнение(Год);	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры
 

#КонецОбласти
